# Pandas - Data Input/Output

In [1]:
import pandas as pd

In [2]:
pip install xlrd

Requirement already satisfied: xlrd in /usr/local/lib/python3.7/dist-packages (1.1.0)

In [3]:
pwd

'/content'

In [4]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [5]:
df = pd.read_csv('example')

In [6]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [7]:
df.to_csv('My_output')

In [8]:
pd.read_csv('My_output')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [9]:
df.to_csv('My_output', index=False)

In [10]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [13]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [14]:
df.to_excel('Excel_Sample2.xlsx', sheet_name='NewSheet')

In [15]:
data = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [16]:
type(data)

list

In [17]:
data[0].head()

                      Bank NameBank  ... FundFund
0                 Almena State Bank  ...    10538
1        First City Bank of Florida  ...    10537
2              The First State Bank  ...    10536
3                Ericson State Bank  ...    10535
4  City National Bank of New Jersey  ...    10534

[5 rows x 7 columns]

In [18]:
from sqlalchemy import create_engine

In [19]:
engine = create_engine('sqlite:///:memory:')

In [20]:
df.to_sql('my_table', engine)

In [21]:
sql_df = pd.read_sql('my_table', con=engine)

In [22]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15